backend/app/controllers/complaints_controller.rb

  def index
    @complaints = Complaint.all
---
SELECT "complaints".* FROM "complaints"